#pragma once

#include <array>

struct RoomEntry {
    u8 roomNo;
    std::vector<s16> roomPoints = {};

    constexpr RoomEntry() : roomNo(0) {}
    constexpr RoomEntry(const RoomEntry& other) = default;

    template <int N>
    constexpr RoomEntry(const u8 roomNo, const s16 (&points)[N]) :
        roomNo(roomNo) {
        for (int i = 0; i < N; i++) {
            roomPoints.push_back(points[i]);
        }
    }

    constexpr RoomEntry(const u8 roomNo) :
        roomNo(roomNo) {
        roomPoints.push_back(0);
    }
};

struct MapEntry {
    const char* mapName;
    const char* mapFile;
    std::vector<RoomEntry> mapRooms = {};

    constexpr MapEntry() : mapName(nullptr), mapFile(nullptr) {}
    constexpr MapEntry(const MapEntry& other) = default;

    template <int N>
    constexpr MapEntry(const char* mapName, const char* mapFile, const RoomEntry (&rooms)[N], const char*) : mapName(mapName),
        mapFile(mapFile) {
        for (int i = 0; i < N; i++) {
            mapRooms.push_back(rooms[i]);
        }
    }

    template <int N>
    constexpr MapEntry(const char* mapName, const char* mapFile, const RoomEntry (&rooms)[N]) :
    mapName(mapName), mapFile(mapFile) {
        for (int i = 0; i < N; i++) {
            mapRooms.push_back(rooms[i]);
        }
    }

    constexpr MapEntry(const char* mapName, const char* mapFile) : mapName(mapName),
                mapFile(mapFile) {}
};

struct RegionEntry {
    const char* regionName = nullptr;
    std::vector<MapEntry> maps = {};

    template <int N>
    constexpr RegionEntry(const char* regionName, const MapEntry (&maps)[N]) : regionName(regionName) {
        for (int i = 0; i < N; i++) {
            this->maps.push_back(maps[i]);
        }
    }
};

static const auto gameRegions = std::to_array({
    RegionEntry("海拉尔平原", {
        MapEntry("海拉尔平原", "F_SP121",
            {
                {0, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 50}},
                {1, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 50}},
                {2, {0, 1, 10, 20, 30}},
                {3, {0, 1, 2, 3, 4, 5, 6, 10, 14, 15, 16, 17, 20, 21, 22, 88, 99}},
                {4, {0, 1}},
                {5, {0}},
                {6, {0, 1, 2, 3, 10, 11, 12, 21, 100, 101}},
                {7, {0, 1, 2, 6, 14, 22}},
                {9, {0, 1, 2, 10}},
                {10, {0, 1, 2, 3, 4, 5, 6, 7, 8, 14, 15, 16, 20, 21, 22, 23}},
                {11, {0, 1}},
                {12, {0, 1, 2, 3, 20, 21}},
                {13, {0, 1, 2, 3, 4, 14, 20, 21, 22, 23, 98, 99}},
                {14, {0, 1}},
                {15, {0, 1, 2, 3, 4, 5, 20, 53, 100, 101}},
            }),
    }),
    RegionEntry("奥登", {
        MapEntry("奥登村", "F_SP103", {
            {0, {0, 1, 2, 4, 5, 6, 7, 9, 11, 13, 14, 15, 20, 21, 22, 23, 24, 25, 26, 27, 30, 99, 100, 101, 102, 103}},
        }),
        MapEntry("林克家门外", "F_SP103", {
            {1, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 20, 21, 23, 24, 25, 26, 27, 30, 99, 100}},
        }, "F_SP103_1"),
        MapEntry("奥登牧场", "F_SP00", {
            {0, {0, 1, 2, 3, 4, 5, 6, 7, 20, 30, 99, 127}},
        }),
        MapEntry("奥登之泉", "F_SP104", {
            {1, {0, 1, 2, 3, 4, 5, 6, 10, 20, 21, 22, 23, 24, 25, 26, 30, 99, 100, 111, 200, 254}}
        }),
        MapEntry("博的家", "R_SP01", {
            {0, {0, 1, 2, 3}},
        }),
        MapEntry("塞拉杂货店", "R_SP01", {
            {1, {0}},
        }, "R_SP01_1"),
        MapEntry("贾格尔的家", "R_SP01", {
            {2, {0, 1, 2, 3}},
        }, "R_SP01_2"),
        MapEntry("林克的家", "R_SP01", {
            {4, {0, 1, 2, 3, 4}},
            {7, {0}},
        }, "R_SP01_4"),
        MapEntry("拉斯尔的家", "R_SP01", {
            {5, {0, 1, 2}},
        }, "R_SP01_5"),
    }),
    RegionEntry("法隆", {
        MapEntry("法隆森林南部", "F_SP108", {
            {0, {0, 3, 4, 20, 21, 22, 23, 24, 25, 100, 254}},
            {1, {0, 1, 2, 3, 6, 20, 21, 100}},
            {2, {0}},
            {3, {0, 5, 99}},
            {4, {0, 1, 2, 7, 8, 9, 23, 100}},
            {5, {0, 1, 2, 3, 4, 6, 7, 10, 24, 25, 50, 60, 98, 100}},
            {8, {0, 1, 2, 3}},
            {11, {0}},
            {14, {0, 1, 2, 3, 10, 50, 100, 150, 200, 254}},
        }),
        MapEntry("法隆森林北部", "F_SP108", {
            {6, {0, 1, 2, 3, 10, 50, 100, 150, 200, 254}},
        }, "F_SP108"),
        MapEntry("迷失森林", "F_SP117", {
            {3, {0, 1, 2, 3, 4, 5, 6}},
        }),
        MapEntry("圣域", "F_SP117", {
            {1, {1, 3, 4, 5, 6, 10, 20, 21, 50, 51, 99, 100, 102, 150, 200, 254}}
        }, "F_SP117_1"),
        MapEntry("时之神殿（过去）", "F_SP117", {
            {2, {0, 1, 3, 52, 101, 102}},
        }, "F_SP117_2"),
        MapEntry("法隆森林洞穴", "D_SB10", {
            {0, {0, 1, 20, 21}},
        }),
        MapEntry("科洛的家", "R_SP108", {
            {0, {0, 1}},
        }),
    }),
    RegionEntry("艾尔丁", {
        MapEntry("卡卡利科村", "F_SP109", {
            {0, {
                0,  1,  2,  3,  4,  5,  6,  7,  8,  9,  10, 11, 12, 13, 14, 15,
                16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 30, 31, 32, 33, 34, 35,
                36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
                52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
                68, 69, 70, 71, 100, 101,
            }},
        }),
        MapEntry("死亡之山道", "F_SP110", {
            {0, {0, 1, 2, 100, 200}},
            {1, {0}},
            {2, {0}},
            {3, {0, 1, 2, 3, 4, 5, 6}},
        }),
        MapEntry("卡卡利科墓地", "F_SP111", {
            {0, {0, 1, 2, 3, 4, 5, 6, 111}},
        }),
        MapEntry("隐者之村", "F_SP128", {
            {0, {0, 1, 2, 3, 4, 5, 100}},
        }),
        MapEntry("雷纳多的神殿", "R_SP109", {
            {0, {0, 2, 3, 5, 6, 7, 8, 10, 20, 21, 22}},
        }),
        MapEntry("神殿地下室", "R_SP209", {
            {7, {0, 1, 2}},
        }),
        MapEntry("巴恩斯炸弹店", "R_SP109", {
            {1, {0, 1, 2, 3}},
        }, "R_SP109_1"),
        MapEntry("艾尔德旅馆", "R_SP109", {
            {2, {0, 1, 2, 3}},
        }, "R_SP109_2"),
        MapEntry("玛洛商店", "R_SP109", {
            {3, {0, 1}},
        }, "R_SP109_3"),
        MapEntry("瞭望塔", "R_SP109", {
            {4, {0, 1, 2}},
        }, "R_SP109_4"),
        MapEntry("炸弹仓库", "R_SP109", {
            {5, {0, 1}},
        }, "R_SP109_5"),
        MapEntry("废弃房屋", "R_SP109", {
            {6, {0, 1, 5}},
        }, "R_SP109_6"),
        MapEntry("戈隆长老之家", "R_SP110", {
            {0, {0, 1, 2, 3, 4, 100}},
        }),
    }),
    RegionEntry("拉聂耳", {
        MapEntry("城下町外·西", "F_SP122", {
            {8, {0, 1, 2, 3, 4, 5, 6, 7, 76, 100, 101, 111, 200, 254}},
        }),
        MapEntry("城下町外·南", "F_SP122", {
            {16, {0, 1, 2, 3, 4, 111}},
        }, "F_SP122_16"),
        MapEntry("城下町外·东", "F_SP122", {
            {17, {0, 1, 4}},
        }, "F_SP122_17"),
        MapEntry("城下町", "F_SP116", {
            {0, {0, 3, 4, 5, 6, 11, 12, 13, 14, 15, 16, 20, 50, 99, 100}},
            {1, {0, 1, 30, 40, 50, 100, 111}},
            {2, {0, 1, 2, 3, 4}},
            {3, {0, 1, 2, 3, 4, 5, 7, 8, 9, 10, 12, 13, 30}},
            {4, {0, 2, 3, 4, 5, 6}},
        }),
        MapEntry("佐拉河", "F_SP112", {
            {1, {0, 1, 2, 3, 4, 5, 6, 7, 10, 11, 12, 13, 14, 15, 16, 17}},
        }),
        MapEntry("佐拉领地", "F_SP113", {
            {0, {0, 1, 3, 4, 5, 7, 8, 10, 50, 97, 99, 254}},
            {1, {0, 1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 20, 30, 34, 98, 100, 101}},
        }),
        MapEntry("海利亚湖", "F_SP115", {
            {0, {
                0,  1,  2,  3,  4,  5,  6,  7,  8,  9,  10, 11, 12, 13, 14, 15,
                16, 17, 20, 25, 29, 30, 31, 32, 33, 34, 40, 50, 55, 70, 75, 76,
                77, 78, 99, 100, 101, 133, 134, 150, 200, 254,
            }},
        }),
        MapEntry("拉聂耳之泉", "F_SP115", {
            {1, {0, 1, 20, 21, 22, 23, 100}},
        }, "F_SP115_1"),
        MapEntry("佐拉河上游", "F_SP126", {
            {0, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 99, 100, 101, 200}},
        }),
        MapEntry("钓鱼池", "F_SP127", {
            {0, {0, 1, 2, 3, 4, 5, 100}},
        }),
        MapEntry("城下町下水道", "R_SP107", {
            {0, {0, 1, 2, 3, 21, 22, 23, 24, 25}},
            {1, {0, 1, 2, 3, 4, 5, 6, 7}},
            {2, {0, 1, 2, 2, 20}},
            {3, {0, 1, 20, 21, 22, 23, 24}},
        }),
        MapEntry("泰尔玛酒吧/密道", "R_SP116", {
            {5, {0, 1, 2, 3, 4, 5, 6, 20, 30}},
            {6, {10, 11, 12, 20, 21}},
        }),
        MapEntry("海娜的小屋", "R_SP127", {
            {0, {0, 1}},
        }),
        MapEntry("因帕兹的家", "R_SP128", {
            {0, {0}},
        }),
        MapEntry("玛洛商店", "R_SP160", {
            {0, {0, 1, 2}},
        }),
        MapEntry("法纳迪的宫殿", "R_SP160", {
            {1, {0, 1, 2}},
        }, "R_SP160_1"),
        MapEntry("诊疗所", "R_SP160", {
            {2, {0, 1, 2}},
        }, "R_SP160_2"),
        MapEntry("阿吉莎的城堡", "R_SP160", {
            {3, {0, 1, 2}},
        }, "R_SP160_3"),
        MapEntry("戈隆商店", "R_SP160", {
            {4, {0, 1, 2}},
        }, "R_SP160_4"),
        MapEntry("乔瓦尼的家", "R_SP160", {
            {5, {0, 1, 2, 3, 4}},
        }, "R_SP160_5"),
        MapEntry("STAR 帐篷", "R_SP161", {
            {7, {0, 1, 2, 3, 4}},
        }),
    }),
    RegionEntry("格鲁德沙漠", {
        MapEntry("布尔布林营地", "F_SP118", {
            {0, {0}}, //TODO: can't load this one far enough to see its valid points
            {1, {0, 1, 2, 6}},
            {3, {0, 2, 3, 4, 5, 7}},
        }),
        MapEntry("布尔布林营地 Beta 房间", "F_SP118", {
            {2, {0}},
        }, "F_SP118_2"),
        MapEntry("格鲁德沙漠", "F_SP124", {
            {0, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 50, 51, 52, 53, 111}},
        }),
        MapEntry("镜子之间", "F_SP125", {
            {4, {0, 1, 2, 3, 4, 5, 6, 7, 8, 51, 52, 54, 55, 56, 57, 58}},
        }),
    }),
    RegionEntry("雪峰", {
        MapEntry("雪峰山", "F_SP114", {
            {0, {0, 1, 2, 4, 5, 6, 7, 10, 13, 14, 15, 100}},
            {1, {1, 2, 3, 5, 6, 9, 10, 11, 12, 13, 20, 21, 22, 100}},
            {2, {8, 12, 13}},
        }),
    }),
    RegionEntry("森林神殿", {
        MapEntry("森林神殿", "D_MN05", {
            {0, {0}},
            {1, {0}},
            {2, {0}},
            {3, {0, 1}},
            {4, {0, 1, 2}},
            {5, {0, 1}},
            {7, {0}},
            {9, {0}},
            {10, {0}},
            {11, {0}},
            {12, {0, 1}},
            {19, {0}},
            {22, {0}},
        }),
        MapEntry("迪亚巴巴战斗场", "D_MN05A", {
            {50, {0, 1}},
        }),
        MapEntry("奥克战斗场", "D_MN05B", {
            {51, {0, 1, 2}},
        }),
    }),
    RegionEntry("戈隆矿山", {
        MapEntry("戈隆矿山", "D_MN04", {
            {1, {0, 1}},
            {3, {0}},
            {4, {0, 1}},
            {5, {0}},
            {6, {0, 1}},
            {7, {0, 1}},
            {9, {0, 1, 2, 3}},
            {11, {0, 1}},
            {12, {0, 1}},
            {13, {0}},
            {14, {0, 1}},
            {16, {0}},
            {17, {0, 1}},
        }),
        MapEntry("法伊拉斯战斗场", "D_MN04A", {
            {50, {0, 1}},
        }),
        MapEntry("丹戈罗战斗场", "D_MN04B", {
            {51, {0, 1, 2, 3}},
        }),
    }),
    RegionEntry("湖底神殿", {
        MapEntry("湖底神殿", "D_MN01", {
            {0, {0, 1, 2}},
            {1, {0}},
            {2, {0}},
            {3, {0, 1, 2}},
            {5, {0, 1, 2}},
            {6, {0, 1, 2}},
            {7, {0}},
            {8, {0, 2}},
            {9, {0, 1, 2, 3, 4}},
            {10, {0, 1}},
            {11, {0}},
            {12, {0, 1, 2}},
            {13, {0}},
        }),
        MapEntry("莫菲鲁战斗场", "D_MN01A", {
            {50, {0, 1, 2, 3}},
        }),
        MapEntry("德库蟾蜍战斗场", "D_MN01B", {
            {51, {0, 1, 2, 3}},
        }),
    }),
    RegionEntry("裁决之地", {
        MapEntry("裁决之地", "D_MN10", {
            {0, {0, 1, 2, 3}},
            {1, {0}},
            {2, {0, 1, 2, 3}},
            {3, {0}},
            {4, {0, 1, 2, 3}},
            {5, {0}},
            {6, {0, 1}},
            {7, {0}},
            {8, {0}},
            {9, {0, 1, 2}},
            {10, {0}},
            {11, {0, 1, 2, 3}},
            {12, {0}},
            {13, {0, 1}},
            {14, {0}},
            {15, {0, 1}},
            {16, {0}},
        }),
        MapEntry("斯塔洛德战斗场", "D_MN10A", {
            {50, {0, 1, 2, 3}},
        }),
        MapEntry("死亡之剑战斗场", "D_MN10B", {
            {51, {0, 1, 2, 3}},
        }),
    }),
    RegionEntry("雪峰遗迹", {
        MapEntry("雪峰遗迹", "D_MN11", {
            {0, {0, 1, 2, 3}},
            {1, {0}},
            {2, {0, 1, 2}},
            {3, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}},
            {4, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10}},
            {5, {0, 1, 2, 3, 4}},
            {6, {0, 1, 2}},
            {7, {0, 10}},
            {8, {0}},
            {9, {0}},
            {11, {0}},
            {13, {0}},
        }),
        MapEntry("布里扎塔战斗场", "D_MN11A", {
            {50, {0, 1, 2, 3}},
        }),
        MapEntry("暗黑锤战斗场", "D_MN11B", {
            {51, {0, 1, 2, 3}},
        }),
        MapEntry("暗黑锤 Beta 战斗场", "D_MN11B", {
            {49, {0, 1, 2}},
        }),
    }),
    RegionEntry("时之神殿", {
        MapEntry("时之神殿", "D_MN06", {
            {0, {0, 1}},
            {1, {0}},
            {2, {0, 1, 2}},
            {3, {0, 1}},
            {4, {0, 1}},
            {5, {0}},
            {6, {0}},
            {7, {0, 1, 2}},
            {8, {0, 1, 2}},
        }),
        MapEntry("阿尔莫戈玛战斗场", "D_MN06A", {
            {50, {0, 1}},
        }),
        MapEntry("暗黑骑士战斗场", "D_MN06B", {
            {51, {0}},
        }),
    }),
    RegionEntry("天空之城", {
        MapEntry("天空之城", "D_MN07", {
            {0, {0, 1, 2, 3, 4, 5}},
            {1, {0}},
            {2, {0, 1, 2, 3, 4}},
            {3, {0, 1, 2, 3}},
            {4, {0, 1, 2}},
            {5, {0, 1, 2}},
            {6, {0, 1, 2, 3, 4, 5, 6, 7, 8}},
            {7, {0}},
            {8, {0}},
            {10, {0, 1, 3}},
            {11, {0, 1}},
            {12, {0, 1, 2, 3}},
            {13, {0, 1}},
            {14, {0, 1, 3}},
            {15, {0, 1, 3, 4}},
            {16, {0, 1, 2}},
        }),
        MapEntry("阿尔戈洛克战斗场", "D_MN07A", {
            {50, {0, 1, 2, 3}},
        }),
        MapEntry("埃拉尔弗斯战斗场", "D_MN07B", {
            {51, {0, 1, 2}},
        }),
    }),
    RegionEntry("黄昏宫殿", {
        MapEntry("黄昏宫殿", "D_MN08", {
            {0, {0, 1, 2, 3, 4, 10, 20, 21, 22}},
            {1, {0, 1}},
            {2, {0, 1}},
            {4, {0, 1}},
            {5, {0, 1, 2}},
            {7, {0, 1}},
            {8, {0}},
            {9, {0, 1, 20, 21}},
            {10, {0, 1}},
            {11, {0, 1, 20, 21, 22}},
        }),
        MapEntry("黄昏宫殿王座之间", "D_MN08A", {
            {10, {0, 1, 21, 23, 24, 25}},
        }),
        MapEntry("幻影赞特战斗场 1", "D_MN08B", {
            {51, {0, 1, 2, 3}},
        }),
        MapEntry("幻影赞特战斗场 2", "D_MN08C", {
            {52, {0, 2}},
        }),
        MapEntry("赞特战斗场", "D_MN08D", {
            {50, {0, 20}},
            {53, {0}},
            {54, {0}},
            {55, {0, 1}},
            {56, {0}},
            {57, {0}},
            {60, {0}},
        }),
    }),
    RegionEntry("海拉尔城堡", {
        MapEntry("海拉尔城堡", "D_MN09", {
            {1, {0, 1, 2, 3}},
            {2, {0, 2, 3}},
            {3, {0}},
            {4, {0, 1, 2}},
            {5, {0}},
            {6, {0, 1}},
            {8, {0}},
            {9, {0, 1, 2}},
            {11, {0, 1, 2, 3, 5}},
            {12, {0, 1, 2, 3, 4, 5, 6, 7, 8}},
            {13, {0}},
            {14, {0, 1, 2, 3, 4, 5}},
            {15, {0, 1, 2, 3, 4, 5, 6, 7}},
        }),
        MapEntry("海拉尔城堡王座之间", "D_MN09A", {
            {50, {0, 1, 2, 10, 20, 21, 22, 120, 121, 122}},
            {51, {0, 1, 2, 10, 20, 21, 22, 120, 121, 122}},
        }),
        MapEntry("骑马加农多夫战斗场", "D_MN09B", {
            {0, {0, 1}},
        }),
        MapEntry("暗黑魔王加农多夫战斗场", "D_MN09C", {
            {0, {0, 20, 21, 22, 23}},
        }),
    }),
    RegionEntry("小迷宫与洞穴", {
        MapEntry("冰之洞窟", "D_SB00", {
            {0, {0}},
        }),
        MapEntry("试炼之洞窟", "D_SB01", {
            {0, {0}},
            {1, {0}},
            {2, {0}},
            {3, {0}},
            {4, {0}},
            {5, {0}},
            {6, {0}},
            {7, {0}},
            {8, {0, 1}},
            {9, {0}},
            {10, {0}},
            {11, {0}},
            {12, {0}},
            {13, {0}},
            {14, {0}},
            {15, {0}},
            {16, {0}},
            {17, {0}},
            {18, {0, 1}},
            {19, {0}},
            {20, {0}},
            {21, {0}},
            {22, {0}},
            {23, {0}},
            {24, {0}},
            {25, {0}},
            {26, {0}},
            {27, {0}},
            {28, {0, 1}},
            {29, {0}},
            {30, {0}},
            {31, {0}},
            {32, {0}},
            {33, {0}},
            {34, {0}},
            {35, {0}},
            {36, {0}},
            {37, {0}},
            {38, {0, 1}},
            {39, {0}},
            {40, {0}},
            {41, {0}},
            {42, {0}},
            {43, {0}},
            {44, {0}},
            {45, {0}},
            {46, {0}},
            {47, {0}},
            {48, {0, 1}},
            {49, {0}},
        }
        ),
        MapEntry("卡卡利科峡谷洞穴", "D_SB02", {
            {0, {0}},
        }),
        MapEntry("海利亚湖洞穴", "D_SB03", {
            {0, {0, 1}},
        }),
        MapEntry("戈隆储物洞穴", "D_SB04", {
            {10, {0, 1}},
        }),
        MapEntry("洞穴 1", "D_SB05", {
            {0, {0, 1}},
        }),
        MapEntry("洞穴 2", "D_SB06", {
            {1, {0, 1}},
        }),
        MapEntry("洞穴 3", "D_SB07", {
            {2, {0, 1}},
        }),
        MapEntry("洞穴 4", "D_SB08", {
            {3, {0, 1}},
        }),
        MapEntry("洞穴 5", "D_SB09", {
            {4, {0, 1}},
        }),
    }),
    RegionEntry("其他", {
        MapEntry("标题画面/布尔布林王 1", "F_SP102", {
            {0, {0, 1, 2, 3, 4, 5, 20, 53, 100, 101}},
        }),
        MapEntry("布尔布林王 2", "F_SP123", {
            {13, {0}},
        }),
        MapEntry("狼嚎过场地图", "F_SP200", {
            {0, {0, 1, 2, 3, 4, 5, 6, 7}},
        }),
        MapEntry("过场：光之箭区域", "R_SP300", {
            {0, {0, 20, 120}},
        }),
        MapEntry("过场：海拉尔城堡王座之间", "R_SP301", {
            {0, {0, 20, 100}},
        }),
        MapEntry("标题画面影片地图", "S_MV000", {
            {0, {0, 1}},
        }),
    })
});
